In [ ]:
import pandas as pd
import numpy as np

In [ ]:
bank_data = pd.read_csv("bank.csv")

In [ ]:
bank_data.head()

In [ ]:
bank_data.describe()

,age,balance,day,duration,campaign,pdays,previous
count,11162.000000,11162.000000,11162.000000,11162.000000,11162.000000,11162.000000,11162.000000
mean,41.231948,1528.538524,15.658036,371.993818,2.508421,51.330407,0.832557
std,11.913369,3225.413326,8.420740,347.128386,2.722077,108.758282,2.292007
min,18.000000,-6847.000000,1.000000,2.000000,1.000000,-1.000000,0.000000
25%,32.000000,122.000000,8.000000,138.000000,1.000000,-1.000000,0.000000
50%,39.000000,550.000000,15.000000,255.000000,2.000000,-1.000000,0.000000
75%,49.000000,1708.000000,22.000000,496.000000,3.000000,20.750000,1.000000
max,95.000000,81204.000000,31.000000,3881.000000,63.000000,854.000000,58.000000

In [ ]:
bank_data.tail()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,deposit
11157,33,blue-collar,single,primary,no,1,yes,no,cellular,20,apr,257,1,-1,0,unknown,no
11158,39,services,married,secondary,no,733,no,no,unknown,16,jun,83,4,-1,0,unknown,no
11159,32,technician,single,secondary,no,29,no,no,cellular,19,aug,156,2,-1,0,unknown,no
11160,43,technician,married,secondary,no,0,no,yes,cellular,8,may,9,2,172,5,failure,no
11161,34,technician,married,secondary,no,0,no,no,cellular,9,jul,628,1,-1,0,unknown,no

In [ ]:
bank_data.shape

(11162, 17)

In [ ]:
bank_data.columns

Index(['age', 'job', 'marital', 'education', 'default', 'balance', 'housing',
       'loan', 'contact', 'day', 'month', 'duration', 'campaign', 'pdays',
       'previous', 'poutcome', 'deposit'],
      dtype='object')

In [ ]:
bank_data.isnull().sum()

age          0
job          0
marital      0
education    0
default      0
balance      0
housing      0
loan         0
contact      0
day          0
month        0
duration     0
campaign     0
pdays        0
previous     0
poutcome     0
deposit      0
dtype: int64

In [ ]:
bank_data['marital'].unique()

array(['married', 'single', 'divorced'], dtype=object)

In [ ]:
bank_data.dtypes

age           int64
job          object
marital      object
education    object
default      object
balance       int64
housing      object
loan         object
contact      object
day           int64
month        object
duration      int64
campaign      int64
pdays         int64
previous      int64
poutcome     object
deposit      object
dtype: object

In [ ]:
bank_data['housing'].value_counts()

no     5881
yes    5281
Name: housing, dtype: int64

In [ ]:
bank_data['loan'].value_counts()

no     9702
yes    1460
Name: loan, dtype: int64

In [ ]:
#Percentage of people who have and don't have a loan
(bank_data['loan'].value_counts()/bank_data.shape[0])*100

no     86.919907
yes    13.080093
Name: loan, dtype: float64

In [ ]:
#Percentage of people who have and don't have a housing loan
(bank_data['housing'].value_counts()/bank_data.shape[0])*100

no     52.68769
yes    47.31231
Name: housing, dtype: float64

# Converting Categorical Values into numeric

method 1

In [ ]:
def replace_marital(val):
    if val=='single':
        return 0
    else:
        return 1

In [ ]:
bank_data['marital'] = bank_data['marital'].apply(replace_marital)

In [ ]:
bank_data.marital.unique()

array([1, 0], dtype=int64)

method 2

In [ ]:
bank_data.housing.unique()

array(['yes', 'no'], dtype=object)

In [ ]:
bank_data['housing'] = bank_data['housing'].replace({'yes':1, 'no':0})

method 3

In [ ]:
bank_data['loan'].replace({'yes':1, 'no':0}, inplace=True)

In [ ]:
bank_data.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,deposit
0,59,admin.,1,secondary,no,2343,1,0,unknown,5,may,1042,1,-1,0,unknown,yes
1,56,admin.,1,secondary,no,45,0,0,unknown,5,may,1467,1,-1,0,unknown,yes
2,41,technician,1,secondary,no,1270,1,0,unknown,5,may,1389,1,-1,0,unknown,yes
3,55,services,1,secondary,no,2476,1,0,unknown,5,may,579,1,-1,0,unknown,yes
4,54,admin.,1,tertiary,no,184,0,0,unknown,5,may,673,2,-1,0,unknown,yes

for job col

In [ ]:
bank_data['job'].unique()

array(['admin.', 'technician', 'services', 'management', 'retired',
       'blue-collar', 'unemployed', 'entrepreneur', 'housemaid',
       'unknown', 'self-employed', 'student'], dtype=object)

In [ ]:
bank_data['job'].replace({'admin.':0, 'technician':1, 'services':2, 'management':3, 'retired':4,
       'blue-collar':5, 'unemployed':6, 'entrepreneur':7, 'housemaid':8,
       'unknown':np.nan, 'self-employed':9, 'student':10}, inplace=True)

In [ ]:
bank_data.job.unique()

array([ 0.,  1.,  2.,  3.,  4.,  5.,  6.,  7.,  8., nan,  9., 10.])

In [ ]:
# default, contact,month, pcoutcome, education, deposit

In [ ]:
bank_data['default'].unique()

array(['no', 'yes'], dtype=object)

In [ ]:
bank_data['default'].replace({'no':0,'yes':1},inplace=True)

In [ ]:
bank_data['contact'].unique()

array(['unknown', 'cellular', 'telephone'], dtype=object)

In [ ]:
bank_data['contact'].replace({'unknown':np.nan,'cellular':0, 'telephone':1},inplace=True)

In [ ]:
bank_data['month'].unique()

array(['may', 'jun', 'jul', 'aug', 'oct', 'nov', 'dec', 'jan', 'feb',
       'mar', 'apr', 'sep'], dtype=object)

In [ ]:
bank_data['month'].replace({'jan':0,'feb':1, 'mar':2, 'apr':3,'may':4,'jun':5,'jul':6,'aug':7,'sep':8,'oct':9,'nov':10,'dec':11},inplace=True)

In [ ]:
bank_data['poutcome'].unique()

array(['unknown', 'other', 'failure', 'success'], dtype=object)

In [ ]:
bank_data['poutcome'].replace({'unknown':np.nan, 'other':0, 'failure':1, 'success':2},inplace=True)

In [ ]:
bank_data['education'].unique()

array(['secondary', 'tertiary', 'primary', 'unknown'], dtype=object)

In [ ]:
bank_data['education'].replace({'secondary':0, 'tertiary':1, 'primary':2, 'unknown':np.nan},inplace=True)

In [ ]:
bank_data['deposit'].unique()

array(['yes', 'no'], dtype=object)

In [ ]:
bank_data['deposit'].replace({'yes':1, 'no':0},inplace=True)

In [ ]:
bank_data.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,deposit
0,59,0.0,1,0.0,0,2343,1,0,NaN,5,4,1042,1,-1,0,NaN,1
1,56,0.0,1,0.0,0,45,0,0,NaN,5,4,1467,1,-1,0,NaN,1
2,41,1.0,1,0.0,0,1270,1,0,NaN,5,4,1389,1,-1,0,NaN,1
3,55,2.0,1,0.0,0,2476,1,0,NaN,5,4,579,1,-1,0,NaN,1
4,54,0.0,1,1.0,0,184,0,0,NaN,5,4,673,2,-1,0,NaN,1

# NORMALIZATION

In [ ]:
#balance col

In [ ]:
bank_data.balance.max()

81204

In [ ]:
bank_data.balance.min()

-6847

In [ ]:
bank_data['balance'] = bank_data['balance'].apply(lambda v : ((v - bank_data.balance.min())/(bank_data.balance.max() - bank_data.balance.min())))

In [ ]:
bank_data.balance.max()

1.0

In [ ]:
bank_data.balance.min()

0.0

In [ ]:
#pdays, duration

In [ ]:
bank_data.pdays.min()

-1

In [ ]:
bank_data.pdays.max()

854

In [ ]:
bank_data['pdays'] = bank_data['pdays'].apply(lambda v : ((v - bank_data.pdays.min())/(bank_data.pdays.max() - bank_data.pdays.min())))

In [ ]:
bank_data.duration.min()

2

In [ ]:
bank_data.duration.max()

3881

In [ ]:
bank_data['duration'] = bank_data['duration'].apply(lambda v : ((v - bank_data.duration.min())/(bank_data.duration.max() - bank_data.duration.min())))

In [ ]:
bank_data.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,deposit
0,59,0.0,1,0.0,0,0.104371,1,0,NaN,5,4,0.268110,1,0.0,0,NaN,1
1,56,0.0,1,0.0,0,0.078273,0,0,NaN,5,4,0.377675,1,0.0,0,NaN,1
2,41,1.0,1,0.0,0,0.092185,1,0,NaN,5,4,0.357566,1,0.0,0,NaN,1
3,55,2.0,1,0.0,0,0.105882,1,0,NaN,5,4,0.148750,1,0.0,0,NaN,1
4,54,0.0,1,1.0,0,0.079851,0,0,NaN,5,4,0.172983,2,0.0,0,NaN,1

In [ ]:
bank_data.describe()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,deposit
count,11162.000000,11092.000000,11162.000000,10665.000000,11162.000000,11162.000000,11162.000000,11162.000000,8816.000000,11162.000000,11162.000000,11162.000000,11162.000000,11162.000000,11162.000000,2836.000000,11162.000000
mean,41.231948,3.432564,0.684824,0.627192,0.015051,0.095121,0.473123,0.130801,0.087795,15.658036,5.190826,0.095384,2.508421,0.061205,0.832557,1.188293,0.473840
std,11.913369,2.587057,0.464607,0.717750,0.121761,0.036631,0.499299,0.337198,0.283012,8.420740,2.572792,0.089489,2.722077,0.127203,2.292007,0.729197,0.499338
min,18.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000
25%,32.000000,1.000000,0.000000,0.000000,0.000000,0.079147,0.000000,0.000000,0.000000,8.000000,4.000000,0.035061,1.000000,0.000000,0.000000,1.000000,0.000000
50%,39.000000,3.000000,1.000000,0.000000,0.000000,0.084008,0.000000,0.000000,0.000000,15.000000,5.000000,0.065223,2.000000,0.000000,0.000000,1.000000,0.000000
75%,49.000000,5.000000,1.000000,1.000000,0.000000,0.097160,1.000000,0.000000,0.000000,22.000000,7.000000,0.127352,3.000000,0.025439,1.000000,2.000000,1.000000
max,95.000000,10.000000,1.000000,2.000000,1.000000,1.000000,1.000000,1.000000,1.000000,31.000000,11.000000,1.000000,63.000000,1.000000,58.000000,2.000000,1.000000